{
    "What happen when you go to google.com?": {
        "comment": [
            "This question evaluates your understanding of different layers of the OSI model and the protocols involved in the process. I would start from the bottom of the stack from layer 1 to layer 7. You can briefly talk about each layer in one for two sentences. Layer 1 would typically not mentioned because it represents the physical network connection. However, you can talk about ARP, how one machine knows the network gateway, dns server, and be prepare to go into the details at each layer. For example, for layer 2, make sure you know about ARP table, MAC address; for layer 6, know the HTTPS handshake, PKI infrastructure, etc..."
        ],
        "resources": [
            "https://github.com/alex/what-happens-when",
            "https://medium.com/@maneesha.wijesinghe1/what-happens-when-you-type-an-url-in-the-browser-and-press-enter-bb0aa2449c1a",
            "https://www.youtube.com/watch?v=dh406O2v_1c"
        ],
        "tags": [
            "security_engineer",
            "security_analyst",
            "application_security_engineer"
        ]
    },
    "What are the best practices to store passwords in database?": {
        "comment": [
            "What they are looking for here is whether the password is hashed or not. What type of hashing algorithm is being used to hash password? Are you using salt? How are the salt stored? Should the salt store with the password? How to generate random salt?"
        ],
        "resources": [
            "https://www.geeksforgeeks.org/store-password-database/",
            "https://stackoverflow.com/questions/1054022/best-way-to-store-password-in-database"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "security_analyst"
        ]
    },
    "When do we encrypt vs hash?": {
        "comment": [
            "With encryption, we use some sort of key to encrypt and decrypt. The purpose of encryption is to maintain confidentiality of the object we want to conceal. We use hash when we want to check whether the object has been tampered/still maintain its integrity. A hashed object cannot be reversed"
        ],
        "resources": [
            "https://en.wikipedia.org/wiki/Cryptographic_hash_function",
            "https://www.youtube.com/watch?v=b4b8ktEV4Bg"
        ],
        "tags": [
            "security_engineer",
            "security_analyst",
            "application_security_engineer"
        ]
    },
    "What are the differences between symmetric and asymmetric encryption?": {
        "comment": [
            "We need to clearly distinguish the differences between the two. The most important difference is symmetric key uses one key for both encryption and decryption while asymmetric encrypt requires a private key and public key. For encryption, we use public key to encrypt the data and use private key to decrypt it. We share our public to whoever needs to share the data with us. There are more to the use of asymmetric encryption. Asymmetric encryption is slower than symmetric encryption"
        ],
        "resources": [
            "https://www.youtube.com/watch?v=AQDCe585Lnc",
            "https://www.youtube.com/watch?v=PivKSmRe_68",
            "https://www.cybrary.it/video/symmetric-encryption-and-asymmetric-encryption/"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "security_analyst"
        ]
    },
    "When do we use asymmetric encryption?": {
        "comment": [
            "Some points that are worth mentioned here are:\n-Asymmetric encryption plays an important role in the PKI infrastructure to verify and validate the identity of the principals involved\n-It is used for the encryption of the symmetric key used in HTTPS protocol or for general encryption like email exchange if we decide to use it for encryption"
        ],
        "resources": ["https://www.youtube.com/watch?v=AQDCe585Lnc"],
        "tags": [
            "security_engineer",
            "security_analyst",
            "application_security_engineer"
        ]
    },
    "When do we use symmetric encryption?": {
        "comment": [
            "We use symmetric encryption because it offers faster speed to encrypt and decrypt contents. However, it only requires the same key to encrypt and decrypt, and that's why we need to mention it is used in conjunction with asymmetric encryption to take advantage of the ability to verify and validate the parties in the communication and exchange secrets safely"
        ],
        "resources": ["https://www.youtube.com/watch?v=Z3FwixsBE94"],
        "tags": [
            "security_engineer",
            "security_analyst",
            "application_security_engineer"
        ]
    },
    "Describe PKI infrastructure": {
        "comment": [
            "This open ended question tests your understanding of different components of PKI infrastructure such as Certificate Authority (CA), asymmetric encryption, how browsers can trust a website, the process to validate the identity of a website, how the certificate is generated, what is certificate signing request, how browser knows to not trust a website, etc. Those are some of the questions to consider when answering this question"
        ],
        "resources": ["https://www.youtube.com/watch?v=t0F7fe5Alwg"],
        "tags": [
            "security_engineer",
            "security_analyst",
            "application_security_engineer"
        ]
    },
    "How do we prevent XSS attacks?": {
        "comment": [
            "One of the most common questions in interview. You should be familiar with different types of XSS (as references in Resources). You should know how to do basic XSS attacks, and how to mitigate them (with content security policy, cookie settings). Portswigger Web Academy is especially helpful"
        ],
        "resources": [
            "https://www.hacksplaining.com/exercises/xss-stored",
            "https://www.hacksplaining.com/exercises/xss-reflected",
            "https://portswigger.net/web-security/cross-site-scripting",
            "https://www.youtube.com/watch?v=JbfNWg6JS4U",
            "https://www.youtube.com/watch?v=mr230uotw-Y",
            "https://www.youtube.com/watch?v=pocsv39pNXA&t=1754s"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer"
        ]
    },
    "How do we prevent CSRF attacks?": {
        "comment": [
            "As one of the OWASP Top 10, you should be familiar with this attack and understand the difference between this attack and XSS. The links under Resources can help with your understanding with the subject"
        ],
        "resources": [
            "https://www.hacksplaining.com/exercises/csrf",
            "https://portswigger.net/web-security/csrf",
            "https://pentesterlab.com/exercises/csrf/course"
        ],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "What is SSRF attack?": {
        "comment": [
            "Although rarely asked, this attack has become more and more common. Having an understanding of it would help, and there is no better place to learn it than PortSwigger Academy"
        ],
        "resources": [
            "https://portswigger.net/web-security/ssrf",
            "https://pentesterlab.com/exercises/ffmpeg_ssrf/course",
            "https://pentesterlab.com/exercises/pdf_ssrf/course"
        ],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "What can we do to prevent XXE?": {
        "comment": [
            "With JSON being used so common, XML is being replaced, but it is still necessary to have an understand how services communicate with XML and attack vectors"
        ],
        "resources": [
            "https://www.hacksplaining.com/exercises/xml-external-entities",
            "https://portswigger.net/web-security/xxe"
        ],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "Given a target company tesla.com, how do you conduct a penetration test?": {
        "comment": [
            "There are a lot of great resources on this, but I would recommend the one under the Resource section. Basically, the idea is to have the scope for the work, what targets are allowed and what are not allowed. Assuming we have consent to do pentest, we would want to do reconnaissance to try to find the vulnerable targets (domains, ips) from the current landscape of the organization. There are a lot of useful techniques to identify and find interesting domains and ips as specified in the video. Once, we have the list of what we need to test, we can try OWASP Top 10 attacks, document the process on how we compromise the application, note the severity and how we can remediate the findings."
        ],
        "resources": ["https://www.youtube.com/watch?v=p4JgIu1mceI"],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "What are the steps in the cyber kill chain?": {
        "comment": [
            "The cyber kill chain are steps/phases that demonstrate what the adversaries must achieve to complete the objective. A sample is given by Lockheed Martin, and earlier the phase that we could stop the hackers from, the better it would be."
        ],
        "resources": [
            "https://www.lockheedmartin.com/en-us/capabilities/cyber/cyber-kill-chain.html"
        ],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "What are the steps to respond to an incident?": {
        "comment": [
            "We can emphasize it is important to map out all of the steps to take during the incident before incident happens. The reason for that is so the team will be prepared and know exactly what steps to follow. Some basic steps would be:\n-Verify if it is actually an incident\n-Determine the scope of the incident - Triaging and Analysis\n-Contain the incident by isolating the infected machines\n-Restore the infected machine through backup\n-Conduct analysis to identify the root causes of the problem - Lesson learned\nAn example of the steps is shown under the Resource section"
        ],
        "resources": [
            "https://www.exabeam.com/incident-response/steps/",
            "https://digitalguardian.com/blog/five-steps-incident-response"
        ],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "What do you think is the most important step when respond to an incident?": {
        "comment": [
            "This answer is totally subjective, and it varies based on your experience as well. In my opinion, root cause analysis is the most important step as it will help the team know exactly what causes the issue. If we don't know the root cause of the problem, the problem will keep happening. Hence, it is important to have a thorough understanding"
        ],
        "resources": [
            "https://www.exabeam.com/incident-response/steps/",
            "https://digitalguardian.com/blog/five-steps-incident-response"
        ],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "What files and their locations do you look for indicator of compromise?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "How do you perform the analysis of hard drive?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "How do you perform the analysis of registry?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "How do you perform the analysis of memory?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "incident_responder",
            "forensics_investigator",
            "security_analyst"
        ]
    },
    "How do you perform threat modeling?": {
        "comment": [
            "An open ended question. Some example questions to know would be:\n-What is the tech stack?\n-Architecture review and deep dive into each layer\n-How services talk each other (whether encryption enabled, how this service authenticates other services)?\n-What data is being stored and how? How data is being transmitted? Who has access to those data?\nThere are so many questions that we can ask, and the purpose of the threat modeling is to identifying ways/vectors someone can infiltrate the application/system to get to the crown jewels"
        ],
        "resources": [
            "https://youtu.be/VbW-X0j35gw",
            "https://www.youtube.com/watch?v=KGy_KCRUGd4",
            "https://www.youtube.com/watch?v=pXr75ufG1uM",
            "https://blog.eccouncil.org/dread-threat-modeling-an-introduction-to-qualitative-and-quantitative-risk-analysis/"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "How do you prioritize tasks?": {
        "comment": [
            "Ideally, you want to prioritize the task that can bring the most value to your team/organization.\n-When it comes to fixing vulnerabilities, you want to prioritize remediating high severity findings. However, that is not always easy as you have to work with other teams to fix that, and they have their priorities as well. It is all about communicating the importance and the value the fix would be.\n-When it comes to your own tasks, if there are multiple conflicting priorities, you have to communicate to your boss what you are working and understand what he/she wants to focus on"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_analyst",
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "incident_responder",
            "forensics_investigator"
        ]
    },
    "Developer pushes back on fixing findings, how would you deal with that?": {
        "comment": [
            "When it comes to fixing vulnerabilities, you want to prioritize remediating high severity findings. However, that is not always easy as you have to work with other teams to fix that, and they have their priorities as well. It is all about communicating the importance and the value the fix would be. We can also escalate if needed"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "What is setuid?": {
        "comment": [
            "This is clearly explained on other websites. What we want to focus on is why it is being used and how someone can exploit it."
        ],
        "resources": [
            "https://www.computerhope.com/jargon/s/setuid.htm#:~:text=Setuid%2C%20which%20stands%20for%20set,certain%20programs%20with%20escalated%20privileges.",
            "https://man7.org/linux/man-pages/man2/setuid.2.html"
        ],
        "tags": ["security_engineer", "infrastructure_security_engineer"]
    },
    "What are the differences between stateful and stateless firewalls?": {
        "comment": [
            "The thing to remember here is stateless firewall does not keep track of the connection session, meaning we would have to create both inbound and outbound rules while stateful firewall remembers what are coming in and out of networks. We only need to configure the rules in one direction for stateful"
        ],
        "resources": [
            "https://www.redhat.com/en/topics/cloud-native-apps/stateful-vs-stateless"
        ],
        "tags": [
            "security_engineer",
            "infrastructure_security_engineer",
            "cloud_security_engineer"
        ]
    },
    "What are the differences between security group and network firewall in AWS?": {
        "comment": [
            "Security group is stateful firewall while network firewall is stateless firewall"
        ],
        "resources": [
            "https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html"
        ],
        "tags": [
            "security_engineer",
            "infrastructure_security_engineer",
            "cloud_security_engineer"
        ]
    },
    "Given a AWS account, what are the steps you take to secure it?": {
        "comment": [
            "I can only give you guidance how you should answer this as this is a very broad question. Security in AWS is about monitoring existing resources and services, preventing misconfigurations from being introduced and fixing current findings. \n-I would check IAM first and see how it is configured (the use of users, groups, roles and permissions, whether SSO is enabled or not)\n-I would then check where we store the most sensitive data (S3, RDS, DynamoDB, etc...) and how we configure those services and resources. A lot of can be pivoted here like resource policy for S3, security group for RDS, etc...\n-I would then check how web applications are deployed and configured (EC2, EKS and Lambda security with the focus on NACL, Security Group and API security)\n-We want to know if GuardDuty, CloudTrail, Config is enabled. There are other security related services that can be used like Trusted Advisor.\nThose are some starting points"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "Given a GCP project, what are the steps you take to secure it?": {
        "comment": [
            "I can only give you guidance how you should answer this as this is a very broad question. Security in GCP is about monitoring existing resources and services, preventing misconfigurations from being introduced and fixing current findings. \n-I would check IAM first and see how it is configured (the use of users, groups, service accounts, roles, whether SSO is enabled or not)\n-I would then check where we store the most sensitive data (Cloud Storage, BigQuery, Bigtable, Cloud SQL, etc...) and how we configure those services and resources. A lot of can be pivoted here like resource policy for Cloud Storage, view for BigQuery, etc...\n-I would then check how web applications are deployed and configured (Compute Engine, GKE and Cloud Function security with the focus on NACL, Security Group and API security)\n-We want to know if Security Command Center with Threat Detection is enabled. There are other security related services that can be used like Policy Intelligence.\nThose are some starting points"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "What are some of the services AWS provides to clients to secure their accounts?": {
        "comment": [
            "There are a few services that you definitely need to know in details:\n-CloudTrail\n-GuardDuty\n-Config\n-Security Hub\n-CloudWatch\n-Trusted Advisor\n-Amazon Detective\n-AWS WAF"
        ],
        "resources": ["https://aws.amazon.com/products/security/?nc=sn&loc=2"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "What are some of the services GCP provides to clients to secure their accounts?": {
        "comment": [
            "There are a few services that you definitely need to know in details:\n-Security Command Center\n-Cloud Data Loss Prevention\n-Firewalls\n-Identity Aware Proxy\n-Cloud Monitor\n-Cloud Armor"
        ],
        "resources": [
            "https://cloud.google.com/products/security-and-identity"
        ],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "Given a three tier web application that is hosted on EC2 and RDS, what would you recommend to secure the application in AWS?": {
        "comment": [
            "We have to understand how the application was designed. What is the technology used? Securing front end application hosted on S3 bucket is different than application running in ElasticBeanstalk or EC2. When it comes to securing EC2 instances, think about image security, patch management, the traffic going in and going out from the instance. We should have a public subnet for public facing instances, and security group rules must be set up to only allow traffics from certain ports like 80 or 443 to come in. Another subnet can be used to put RDS instances in and security group rule set up to only allow traffic from the public subnet to come in. All traffic should be encrypted. The roles attached to the instances should follow least privilege principle. Those are some of the pointers."
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "Given a three tier web application that is hosted on EC2 and RDS, what would you recommend to secure the application in GCP?": {
        "comment": [
            "We have to understand how the application was designed. What is the technology used? Securing front end application hosted on Cloud Storage bucket is different than application running in AppEngine or Compute Engine. When it comes to securing Compute Engine instances, think about image security, patch management, the traffic going in and going out from the instance. We should have a public subnet for public facing instances, and firewall rules must be set up to only allow traffics from certain ports like 80 or 443 to come in. Another subnet can be used to put RDS instances in and security group rule set up to only allow traffic from the public subnet to come in. All traffic should be encrypted. The service accounts attached to the instances should follow least privilege principle. Those are some of the pointers."
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "How do you secure API endpoints?": {
        "comment": [
            "There are a couple things we can mention:\n-Cross-Origin Resource Sharing (CORS)\n-Rate limiting\n-API key authentication\n-Request validation\n-Web Application Firewall"
        ],
        "resources": [
            "https://docs.aws.amazon.com/apigateway/latest/developerguide/api-gateway-method-request-validation.html"
        ],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "How do you secure PII data?": {
        "comment": [
            "A vague question, and we would want to ask for elaboration on what they want to secure and in what context.\n-In general, we want to follow the least privilege and separation of duties principles.\n-PII data should be encrypted with KMS.\n-Encryption keys should be rotated frequently.\n-PII data should be scrubbed in the environments other than production environment\n-Database password should be rotated and kept in Secret Manager"
        ],
        "resources": ["https://aws.amazon.com/blogs/security/tag/pii/"],
        "tags": [
            "security_analyst",
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "What can we do to secure database?": {
        "comment": [
            "In general, we would want:\n-Put database in private subnet and only allow inbound traffic from subnet hosting web application\n-Rotate admin password and kept in Secret Manager and make sure to rotate frequently\n-Encrypt the database with KMS CMK or customer's encryption key\n-Access to read/write to the database should be restricted to roles and follow least privilege principle"
        ],
        "resources": ["https://aws.amazon.com/rds/features/security/"],
        "tags": [
            "security_analyst",
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "How do you design a vulnerability management service in AWS/GCP at scale?": {
        "comment": [
            "The question is more about asking how we can detect vulnerabilities and misconfigurations at scale. Each company does this differently. In AWS, we can detect vulnerabilities with GuardDuty, Config or custom Lambda functions or ECS that keep running and checking all resources. We can use third party services like Dome9 or Prisma Cloud. Remediating findings is what is difficult because we have to think about how we can keep track of findings to avoid duplicates, fix findings without interrupting business, and how we can whitelist a certain finding, etc...These are just some pointers to think about"
        ],
        "resources": ["https://www.youtube.com/watch?v=-BjCREhT9O8"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "What are the differences between IAM role and IAM group in AWS?": {
        "comment": [
            "Roles can be use to give out a set of permissions for other to use for a brief set of period. Group is a set of users without permissions. We have to give group permissions for members within the group to perform tasks"
        ],
        "resources": ["https://aws.amazon.com/iam/faqs/"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "What are some of the best practices to secure IAM?": {
        "comment": [
            "From my experience, it is best that we avoid the use of IAM users. If we have to use IAM users, make sure to enable MFA and create strong password policy. We should use roles instead and set up identity providers so that user can assume and use roles based on their current credentials in Active Directory. Access given to them should be roles. Permissions given to roles should be in details to the API levels and resource levels in the case of AWS. In GCP, we can grant access to certain resources in the resource page."
        ],
        "resources": [
            "https://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html"
        ],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "What are some of the ways to manage EC2 instances?": {
        "comment": [
            "There are a few way to manage EC2 instances:\n-Using bastion host\n-Identity Aware Proxy\n-Configuration management tool (Salt, Ansible, etc...)\n-SSH keys and managing keys distribution\nEach has pros and cons"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer",
            "application_security_engineer"
        ]
    },
    "How do we execute commands in EC2 instances in a secure way?": {
        "comment": [
            "It is best that we use configuration management tool like Ansible or even AWS SSM to manage EC2 instances for us. We want to avoid having to go to each individual instance and instead manage the changes and configuration from a central location"
        ],
        "resources": ["https://www.youtube.com/watch?v=YNoGjBhncZ0"],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "How do we restrict access to the production environment?": {
        "comment": [
            "I would say the ideal way would be to not allow any manual changes (changes using the console) in the production environment. Every deployment must be through infrastructure as code and pipeline to scan for vulnerabilities. Access to production environment should be limited to read only and only grant write access to service account that CI tools use. In case engineers need to access production environment, we can have break glass procedures to grant them temporary access but with approval from management"
        ],
        "resources": ["N/A"],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "A developer comes to you with question on how to secure secret token used in application. What would you recommend?": {
        "comment": [
            "A recommended way would be store secrets in secret manager such as HashiCorp Vault, AWS Secret Manager. Why?\n-Secrets are secured and encrypted\n-Secrets can be access through APIs\n-Secrets in source code should be avoided at all cost to prevent compromise"
        ],
        "resources": [
            "https://www.youtube.com/watch?v=VYfl-DpZ5wM",
            "https://www.youtube.com/watch?v=Y3Gn_iP3FlE"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "How do we secure micro-services?": {
        "comment": [
            "This is a vague question. A general way to answer this is to ask more questions such as:\n-Tech stack\n-Whether we are using managed service like EKS, GKE or host our own Kubernetes cluster\n-How services talk to one another (encrypted traffic or not) using what authentication method\n-How we gain visibility into the service mesh using technology such as Istio\n-Network traffic monitoring and network policy\n-Pod Security Policy"
        ],
        "resources": [
            "https://www.youtube.com/watch?v=VtUQINsYXDM",
            "https://www.youtube.com/watch?v=hTgff3cJ6AU",
            "https://www.youtube.com/watch?v=16fgzklcF7Y"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "How do we secure Kubernetes, EKS, ECS?": {
        "comment": [
            "There are a lot of good talks on this topic. A few things to consider are:\n-Container Image (How to create golden image)\n-Pod Security (Root access restriction, runtime usage)\n-Network Security\n-Traffic between services (monitoring solution)\n-Runtime Security\n-Roles and users access\n-Certificate authority and CSR process\netc..."
        ],
        "resources": [
            "https://www.youtube.com/watch?v=4l4Kuds8O3s",
            "https://www.youtube.com/watch?v=TdQoWEHAl0k",
            "https://www.youtube.com/watch?v=wqsUfvRyYpw",
            "https://www.youtube.com/watch?v=16fgzklcF7Y",
            "https://www.youtube.com/watch?v=6zDrLvpfCK4",
            "https://www.youtube.com/watch?v=DNKcRUyz4Hw"
        ],
        "tags": [
            "security_engineer",
            "application_security_engineer",
            "cloud_security_engineer",
            "infrastructure_security_engineer"
        ]
    },
    "How do you design a token generator service used in MFA?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "How do you design a key management service similar to AWS KMS?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": ["security_engineer", "application_security_engineer"]
    },
    "How do you design a secret management service similar to AWS Secret Manager/HashiCorp Vault?": {
        "comment": ["Pending contribution..."],
        "resources": ["N/A"],
        "tags": ["security_engineer", "application_security_engineer"]
    }
}
